tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "timescale/tap"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Next-gen compiler infrastructure
brew "llvm"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@16"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Safe, concurrent, practical language
brew "rust"
# Software for mathematics, science, and engineering
brew "scipy"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.4"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "iMovie", id: 408981434
mas "Microsoft Outlook", id: 985367838
mas "Xcode", id: 497799835
